/* Программа обеспечивает расчёт деления полиномов
-423422х^10+243242х^6-97976967х^2 и 467*x^18-748392*x^14+0,00006*x^5
для произвольного значения х
Автор: Руслан Бакиев, гр. 9005. Версия: 3.1.1
Дата начала разработки: 19.01.2020. Дата сдачи программы: 21.01.2020
*/

#include <iostream>
#include <iomanip>

using namespace std;
int main()
{
    setlocale(LC_ALL, "RUSSIAN");
    float x, Q1, Q2;
    const float t1 = -423422, t1_2 = 243242, t1_3 = -97976967, t2 = 467, t2_2 = -748392, t2_3 = 0.00006;
    cout << " Программа обеспечивает расчёт деления полиномов\n" <<
        "-423422х^10+243242х^6-97976967х^2 и 467*x^18-748392*x^14+0,00006*x^5\n"
        << "Автор: Бакиев Руслан\n" << "x в диапазоне: ([+-10^-8+-10^8])\n"
        << "Формат ввода: +-ddd.ddd" << endl;
    cout << "Введите значение х:";
    cin >> x;
    cout << "Расчет: ";
    Q1 = ((t1 * x * x * x * x + t1_2) * x * x * x * x + t1_3) * x * x;
    Q2 = ((t2 * x * x * x * x + t2_2) * x * x * x * x * x * x * x * x * x + t2_3) * x * x * x * x * x;
    cout << setw(12) << setprecision(8) << Q1 / Q2 << endl;
}